/*
Navicat MySQL Data Transfer

Source Server         : 192.168.0.243
Source Server Version : 50627
Source Host           : 192.168.0.243:3306
Source Database       : thd

Target Server Type    : MYSQL
Target Server Version : 50627
File Encoding         : 65001

Date: 2019-08-16 19:57:43
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for designer_answer
-- ----------------------------
DROP TABLE IF EXISTS `designer_answer`;
CREATE TABLE `designer_answer` (
  `a_id` int(11) NOT NULL AUTO_INCREMENT COMMENT '自增id',
  `a_questions_id` int(11) NOT NULL COMMENT '问题的id',
  `a_mid` varchar(64) CHARACTER SET utf8 COLLATE utf8_bin NOT NULL DEFAULT '' COMMENT '设计师的mid',
  `a_nickname` varchar(64) DEFAULT NULL COMMENT '个人用户昵称',
  `a_pic` varchar(256) DEFAULT '' COMMENT '用户头像',
  `a_answer` varchar(255) NOT NULL COMMENT '设计师的答案',
  `a_access_device` tinyint(2) NOT NULL DEFAULT '1' COMMENT '访问设备 1 PC 2 安卓 3 IOS 4 其他',
  `a_status` tinyint(1) DEFAULT '1' COMMENT ' 1表示未查看、 2表示未采纳、 3表示已采纳',
  `satisfied` int(6) NOT NULL DEFAULT '0' COMMENT '满意',
  `no_satisfied` int(6) NOT NULL DEFAULT '0' COMMENT '不满意',
  `a_del` tinyint(1) NOT NULL DEFAULT '1' COMMENT '1表示显示、0表示删除',
  `created_at` datetime NOT NULL COMMENT '创建时间',
  `updated_at` datetime NOT NULL COMMENT '修改时间',
  PRIMARY KEY (`a_id`)
) ENGINE=InnoDB AUTO_INCREMENT=28 DEFAULT CHARSET=utf8mb4 COMMENT='设计师的回答';

-- ----------------------------
-- Records of designer_answer
-- ----------------------------
INSERT INTO `designer_answer` VALUES ('1', '1', '761eca9862310ba4c9e81d7a77754711', '小宝', '5987d2dfd2b18.png', 'Home to buy a new house brother and identity and who to find...\n\n', '1', '1', '2', '3', '1', '2019-08-13 10:16:26', '2019-08-13 10:16:26');
INSERT INTO `designer_answer` VALUES ('2', '3', '761eca9862310ba4c9e81d7a77754711', '大宝', '5987d2dfd2b18.png', '马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。安静的回复骄傲的说法氨基酸的回复骄傲的说法丹凤街按此徐泾镇得分就爱上道具卡三等奖微积分看电视剧库存是福晶科技发生的会计法 康师傅接口了的骄傲是非常 客', '1', '3', '3', '5', '1', '2019-08-13 10:16:29', '2019-08-13 10:16:29');
INSERT INTO `designer_answer` VALUES ('3', '1', '761eca9862310ba4c9e81d7a77754711', '程旭辕', '5987d2dfd2b18.png', '马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。安静的回复骄傲的说法氨基酸的回复骄傲的说法丹凤街按此徐泾镇得分就爱上道具卡三等奖微积分看电视剧库存是福晶科技发', '1', '1', '5', '4', '1', '2019-08-13 10:18:58', '2019-08-13 10:18:58');
INSERT INTO `designer_answer` VALUES ('17', '1', 'ff8c35e26b91ac79ebdc9dad1e6fe73f', '陈达解决计', '5add85477318e.JPG', '巴拉巴拉巴贝拉拉不拉了波兰梵蒂冈大', '1', '1', '6', '0', '1', '2019-08-13 15:03:19', '2019-08-13 15:23:34');
INSERT INTO `designer_answer` VALUES ('18', '1', 'ff8c35e26b91ac79ebdc9dad1e6fe73f', '陈达解决计', '5add85477318e.JPG', '巴拉巴拉阿托管人热爱贵阳银行', '1', '2', '7', '3', '1', '2019-08-13 15:03:39', '2019-08-13 16:43:10');
INSERT INTO `designer_answer` VALUES ('19', '1', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '巴拉巴拉家违法看电视剧考虑过加热不卡机', '1', '1', '0', '1', '1', '2019-08-13 15:04:40', '2019-08-13 15:04:40');
INSERT INTO `designer_answer` VALUES ('20', '4', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '巴的凯撒计费GV抵抗力散发的考虑机构个埃尔文加入了规范娟娟', '1', '1', '3', '48', '1', '2019-08-13 15:04:47', '2019-08-13 15:04:47');
INSERT INTO `designer_answer` VALUES ('21', '4', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '巴拉巴卡萨丁见覅及欧几里得是分开假道伐虢个骄傲就', '1', '2', '4', '2', '1', '2019-08-13 15:04:47', '2019-08-13 15:04:47');
INSERT INTO `designer_answer` VALUES ('22', '1', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '深刻的骄傲法律给你看的考虑设计阿佛二维牛AJ付款即', '1', '1', '9', '6', '1', '2019-08-13 15:04:48', '2019-08-13 15:04:48');
INSERT INTO `designer_answer` VALUES ('23', '5', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '简爱客服将诶今晚发v搞不好金卡，GV', '1', '1', '2', '8', '1', '2019-08-13 15:04:48', '2019-08-13 15:04:48');
INSERT INTO `designer_answer` VALUES ('24', '5', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '的萨菲的撒巨孚达看数据覅偶骄傲根据', '1', '2', '4', '2', '1', '2019-08-13 15:04:48', '2019-08-13 15:04:48');
INSERT INTO `designer_answer` VALUES ('25', '5', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。安静的回复骄傲的说法氨基酸的回复骄傲的说法丹凤街按此徐泾镇得分就爱上道具卡三等奖微积分看电视剧库存是福晶科技发生的会计法 康师傅接口了的骄傲是非常 客', '1', '1', '6', '15', '1', '2019-08-13 15:04:48', '2019-08-13 15:04:48');
INSERT INTO `designer_answer` VALUES ('26', '1', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。安静的回复骄傲的说法氨基酸的回复骄傲的说法丹凤街按此徐泾镇得分就爱上道具卡三等奖微积分看电视剧库存是福晶科技发生的会计法 康师傅接口了的骄傲是非常 客', '1', '1', '9', '0', '1', '2019-08-13 15:05:18', '2019-08-13 15:05:18');
INSERT INTO `designer_answer` VALUES ('27', '2', '761eca9862310ba4c9e81d7a77754711', '陈达解决计', '5add85477318e.JPG', '马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。马应龙口红 我最近的口红指标之一献给了马应龙。对，就是那个传说中网友们用痔疮膏祛黑眼圈的马应龙，他们现在什么都做，从护肤（以眼部护理为主）到彩妆，气垫都有，所以出口红也蛮正常的了。安静的回复骄傲的说法氨基酸的回复骄傲的说法丹凤街按此徐泾镇得分就爱上道具卡三等奖微积分看电视剧库存是福晶科技发生的会计法 康师傅接口了的骄傲是非常 客', '1', '2', '10', '0', '1', '2019-08-13 16:37:59', '2019-08-13 16:49:24');
